{"id":"24889110331423580", "giveSurvey":false, "type":"session", "title":"Birds-of-a-Feather Lunch & Expo Open", "plenary":true, "selectable":true, "startTime__date":"2012-05-01T11:30:00-04:00", "endTime__date":"2012-05-01T12:30:00-04:00", "track":"", "location":"Atrium", "abstract":"Table: What’s a Hadoop?\nHost: Ryan Merriman, Avalon Consulting LLC\nTopic:  Join us for a discussion about all things Hadoop. Learn about MapReduce and how Hadoop connects to other tools and frameworks. We plan on sharing our experiences and look forward to hearing about yours.\nTable: Big Data challenges in legal contracts and financial documents\nHost: Michael Will, Innodata Isogen\nTopic: Discussion on the approaches for proactive risk management across portfolios of legal agreements and financial documents to cope with volume, velocity and complexity.\nTable: Are you managing content or are you managing assets?\nHosts: Christopher Hill, Really Strategies, Inc\nTopic: Artificial distinctions between \"content\" and \"assets\" are blurring. Images and their variants, multimedia files, readers' comments, permissions, and rights---all of these objects can be as important as original content from authors. In this BOF we’ll discuss how organizations approach the management of content and assets and whether or not it’s important to differentiate between the two.\nTable: Crossing the Digital Chasm\nHosts: Seetharaman Krishamoothy, Tata Consulting Services\nTopic: Exploring the urgent need for an integrated digital publishing workflow to support the migration of publishers to an increasingly digital world.\nTable: Semantics, Lexicons, and Advanced Discovery\nHosts: Sergio Restrepo, Yuxi Pacific\nTopic: Increasingly large and disparate data sets, otherwise known as Big Data, are presenting enormous challenges within the search community. However these same data sets also provide an opportunity to use several unique and innovative features within MarkLogic to enable effective techniques that improve quality of results. Discuss innovative ways to leverage advanced MarkLogic lexicons and semantic\n indexes to enable better discovery within large data sets.\n \nTable: Obstacles of gathering data from the Internet \nHosts: Justin Gilbreath, 30 Digits\nTopic: The Internet is an unequivocal information library, and social-media is becoming increasingly important. Data behind the firewall is in a plethora of repositories that aren’t standardized. Discus\ns how to harvest, structure, enrich, and feed information at scale to MarkLogic; retaining security and improving ease of access and possibilities for repurposing.\n \nTable: MarkLogic Certification Program\nHosts: Gail Schilling & Greg Nist, MarkLogic University\nTopic: We are building a MarkLogic certification program. This is your opportunity to provide input into the program and help shape the requirements.\n \nTable: Big Data for Telecoms and Utilities  \nHosts: Carl Martin, President Apex Engineering Solutions, Apex CoVantageTopic: Come discuss the unique challenges that Telecoms and Utilities face in terms of managing Big Data.\n  Table: Converting data to XML for ingestion into MarkLogic Server\nHosts: David Skurnik, DCL\nTopic: This is an open discussion of the benefits and best practices associated with converting content to XML for integration into a MarkLogic server. Participants are encouraged to bring questions, ideas, and examples from any and all stages of past, current, or potential integration projects.\nTable: Big Data Meets Content Intelligent Metadata\nHosts: Jeremy Bentley, Smartlogic\nTopic: Metadata is widely accepted as a critical element of search, discovery, and classification across all types of content including Big Data. Adding consistent metadata to any content type either based on taxonomies\/ ontologies or through sentiment analysis and fact extraction can improve the quality and depth of Big Data.\n \nTable: Media Solutions Roadmap\nHosts: Deena Malkina and Steve Guttman, MarkLogic\nTopic: Do you want to help shape MarkLogic's Media Solutions roadmap? Join us for an interactive discussion on the Media product investments we're currently evaluating and share your input on what you'd like to see next.", "speakers":[], "surveys":[{"comments":"Ron needs to rehearse.", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"Good quality food ", "speakerRating":5, "contentRating":5}]}