{"id":"26563567621633412", "giveSurvey":false, "type":"session", "title":"Birds-of-a-Feather Lunch & Expo Open", "plenary":true, "selectable":true, "startTime__date":"2012-05-02T12:00:00-04:00", "endTime__date":"2012-05-02T13:00:00-04:00", "track":"", "location":"Atrium", "abstract":"Table: Performance\nHosts: Michael Blakeley, independent consultant and Hsiao Su, MarkLogic\nTopic: Wanna talk performance?  Have questions about deployment configuration, query tuning, ingestion, data modeling for performance, or other performance topics?  Come join well-known performance experts, Mike and Hsiao, for lunch.\n   \nTable: Crazy Feature Ideas\nHosts: Stephen Buxton and Deena Malkina, MarkLogic\nTopic: Do you have some wild ideas you'd love to see implemented in MarkLogic?  Do you want to hear about the crazy requests we've received in the past?  This is the table for you.\n  \nTable: Search\nHosts: Beverly Jamison, American Psychological Association and Colleen Whitney, MarkLogic\nTopic: Searching for answers about search?  Drop by for lunch and pick up some tips from search experts, Colleen and Beverly.\n \nTable: Hadoop and MarkLogic \nHosts: Rikin Shah, Hortonworks and Justin Makeig, MarkLogic\nTopic: Got Big Data? Wondering how to use Hadoop and MarkLogic together? Join Rikin and Justin over lunch and learn more about our partnership and how it can help you.\n \nTable: Mobile apps \nHosts: Matt Turner and Fernando Mesa, MarkLogic\nTopic: Wanna talk about search UI for mobile devices?  Or perhaps how to manage code, data, and deployments for multiple devices? We'll be talking about all things mobile here with Matt and Fernando.\n \nTable: XQuery, XSLT, and all things XML \nHosts: John Snelson and Evan Lenz, MarkLogic\nTopic: Love XQuery?  Interested in latest trends, tools, questions, and techniques? Don't be an ignored processing instruction - come join John and Evan as they geek out over all things XML!\n \nTable: Academia and Education \nHosts: Christie Hoyle and Clark Richey, Jr., MarkLogic\nTopic: MarkLogic recently announced an Academic license and is looking to help instructors and researchers solve Big Data problems. If you have ideas and connections to share or simply want to talk with us about this, come join Clark and Christie over lunch.", "speakers":[], "surveys":[{"comments":"Venue too noisy to hear conversations effectively", "speakerRating":4, "contentRating":4}]}