{"id":"34596331790089610", "giveSurvey":false, "type":"session", "title":"Tools and Techniques, Part 2", "plenary":false, "selectable":true, "startTime__date":"2012-05-01T15:15:00-04:00", "endTime__date":"2012-05-01T16:15:00-04:00", "track":"Lightning talks", "location":"Meridian D & E", "abstract":"R You Ready to Excel? \nPete Aven, MarkLogic \n \nWhat are the characteristics of a system built for Big Data and how does MarkLogic fit the bill? A system that is Magnetic, Agile, and Deep provides for the ingestion and analysis of real-time, unstructured data. Now that we've got the data in there, let's take advantage of the Server to perform analysis using the tools we already know and love: Excel and R. In this lightning talk we'll explore how to quickly integrate R and Excel with Big Data in MarkLogic to take advantage of both.\n \nLinking Documents via the Semantic Library \nPeter Lindes, LDS\n \nThe LDS Church has millions of pages of documents that are or will be published online, and most of these are translated into a number of languages, in some cases over 100 languages. We want to make it easy for users to find connections between documents that address the same or related topics, and to navigate using these connections throughout the whole content space, both within a language and across languages. We discuss the methods used to build and query our web of data, and the challenges we have faced in the process. We will also discuss what we have learned about the effectiveness and performance of the MarkLogic triple store, as well as our lessons learned from trying to integrate MarkLogic with the Top Braid suite of products.\n \nGoogle Chart Tools \nDavid Lee, MarkLogic\n \nGoogle Visualization (Google Chart Tools) provides simple and powerful charting and visualization tools for the web. The data can come from any database which exposes a web service conforming to the Google Source specifications. Unfortunately this format is a proprietary version of JSON which can be tedious to generate from MarkLogic. This talk demonstrates a simple XQuery module which converts MarkLogic query results into the format required by Google Visualization allowing simple presentation of stunning interactive charts with live data in any web site.", "speakers":[{"affiliation":"MarkLogic", "bio":"Pete Aven is a senior software engineer with MarkLogic Corporation, responsible for the connectors and toolkits. He has spent the last decade helping customers to query, identify, use, transform, and move information by integrating multiple and varied systems and applications. He is currently focused on integrations with MarkLogic products, Microsoft Office, and the Open XML formats. He holds a bachelor’s degree in linguistics and computer science from UCLA.", "email":"pete.aven@marklogic.com", "name":"Pete Aven", "title":"Senior Engineer"},{"affiliation":"Church of Latter-Day Saints", "bio":"", "email":"", "name":"Peter Lindes", "title":"Senior Software Engineer"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"David Lee", "title":"Lead Engineer"}], "surveys":[{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"Peter Lindes", "speakerRating":4, "contentRating":5},{"comments":"Pete Aven", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":4}]}