{"id":"61218661558814344", "giveSurvey":false, "type":"session", "title":"Big Data Search", "plenary":false, "selectable":true, "startTime__date":"2012-05-03T13:15:00-04:00", "endTime__date":"2012-05-03T14:15:00-04:00", "track":"Business", "location":"Amphitheater", "abstract":"Find out how MarkLogic customers get better answers and find what they're looking for with MarkLogic Big Data Search. This session will feature MarkLogic's CTO Chris Biow, Worldwide Enterprise Solutions Director Fernando Mesa and Worldwide Media Solutions Director Matt Turner in a lively discussion with demonstrations of MarkLogic applications that go beyond just links. These applications feature unique views across all an organization's data, provide analysis for decision support and help user identify risk and get the data they are looking for. There will also be some special guests joining in and adding spice to the conversation about how MarkLogic lets organizations get the most out of their information with Big Data Search.", "speakers":[{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Matt Turner", "title":"Principal Media Technologist"},{"affiliation":"MarkLogic", "bio":"Chris Biow is Public Sector CTO and Vice President at MarkLogic Corporation, providing technical leadership for the company’s government division. He has worked with Big Data, search, database, and knowledge management applications for over twenty years, previously at Verity, Autonomy, and the Naval Research Laboratory. His work includes Big Data  projects with the Department of Defense, the National Archives, the U.S. intelligence community, and Bloomberg News. His career also includes 8 years as a Radar Intercept Officer, flying the aircraft-carrier-based F-14 Tomcat. Chris is a graduate of the United States Naval Academy and earned his Master’s degree from the University of Maryland.\n", "email":"chris.biow@marklogic.com", "name":"Chris Biow", "title":"Federal CTO, VP"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Fernando Mesa", "title":"Principal Technologist"}], "surveys":[{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"Like the details and history About search where it is gone through...\n", "speakerRating":5, "contentRating":5}]}