{"id":"61341155631768984", "giveSurvey":false, "type":"session", "title":"XQuery Hour", "plenary":false, "selectable":true, "startTime__date":"2012-05-02T11:00:00-04:00", "endTime__date":"2012-05-02T12:00:00-04:00", "track":"Lightning talks", "location":"Meridian D & E", "abstract":"XQuery Gotchas\nEvan Lenz, MarkLogic\n \nXQuery is a wonderfully productive language, especially when coupled with MarkLogic. Yet as with any language, it has its own dark corners and surprises. In this fast-paced lightning talk, we'll run through a litany of common XQuery gotchas, programming mistakes, and performance pitfalls. Many will apply to XQuery programming in general and some will be MarkLogic-specific. For each one, you'll learn the gist of the problem, the reason it fools people, and the way to avoid it. Come to commiserate. Come to preemptively save yourself time and frustration. Come to pick up tips and techniques for helping you to write faster, cleaner, and more robust code.\n \nStupid XQuery Tricks\nRon Hitchens, Overstory, Ltd.\n \nThis talk will take a light-hearted - yet enlightening - look at some of the clever, little known, surprising and\/or infuriating aspects of XQuery. XQuery is a powerful functional language, especially with the MarkLogic extensions. But XQuery is not a procedural language like Java or C#, nor is it \"SQL for XML\". XQuery has its own bag of tricks and its own pitfalls. This talk will address some of the common (and amusing) newbie mistakes, some powerful XQuery idioms that are not obvious to procedural thinkers, and a bit of advanced XQuery ninja-fu. There may also be a few examples of perfectly innocent looking XQuery code that is utterly wrong. Humor yes, but also serious tips and tricks to make you a better XQuery programmer.\n \nXQuery Enhancements\nJohn Snelson, MarkLogic\n \nThis talk is a practical introduction to some of the XQuery enhancements John Snelson is working on for a future release of MarkLogic, including some features from XQuery 3.0. It will include real world examples of how these enhancements can be used.", "speakers":[{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Evan Lenz", "title":"Software Developer, Community "},{"affiliation":"Overstory, Ltd.", "bio":"Ron is well-qualified as a MarkLogic expert — he spent five years at MarkLogic on the Core Server Engineering Team.\n \nRon joined MarkLogic in the early startup days, as employee #20. By the time he left, MarkLogic was well-established as the industry-leading XML platform and had grown to nearly 200 people.\n \nRon is also an accomplished Java architect, author and conference speaker. Java NIO was published by O'Reilly in 2002, Ron was awarded the JavaOne Rockstar Award in 2005 and was inducted by Sun into the Java Champions program in 2008.\n \nWhile at MarkLogic, Ron also wrote Getting Started with XQuery for the Pragmatic Programmers Bookshelf. Ron has spoken nearly every year at the annual MarkLogic User Conference (as well as helping organise the first several).", "email":"", "name":"Ron Hitchens", "title":"Co-Founder and Principal Consultant"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"John Snelson", "title":"Sr. Engineer"}], "surveys":[{"comments":"More of this!!!", "speakerRating":5, "contentRating":5},{"comments":"Awesome features I can't wait for in XQuery 3", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"Good info but too much was packed into one hour.  Unable to digest the information as fast as it was coming, which precludes informed questions.", "speakerRating":4, "contentRating":4},{"comments":"Rich content, thanks ", "speakerRating":5, "contentRating":5},{"comments":"was informative but without information about performance of solutions", "speakerRating":5, "contentRating":5},{"comments":"Rich content, thanks ", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"It was a shame that some of their material had to be rushed through (lack of coordination between presenters and conference planners?), but what we did see was plenty of fascinating and very useful information.", "speakerRating":5, "contentRating":5},{"comments":"Went to fast over some of the content.", "speakerRating":4, "contentRating":4}]}