{"id":"79813569075812656", "giveSurvey":false, "type":"session", "title":"Search Intelligence with MarkLogic Seach API", "plenary":false, "selectable":true, "startTime__date":"2012-05-03T11:00:00-04:00", "endTime__date":"2012-05-03T12:00:00-04:00", "track":"Technical", "location":"Hemisphere A", "abstract":"A requirement of many user-facing search services is to provide fast, accurate search results without a complicated GUI or search syntax. A user-friendly search engine needs to be able to infer as much as possible from a simple query in order to give the user as specific and complete result set as possible. This session will demonstrate XQuery strategies developed at Jones McClure Publishing for transforming user queries into more intelligent queries that leverage content-specific markup for speed and accuracy without additional input from the user. The presentation will give an overview of the basic templates and present several examples of real world implementations that enhance users’ search experience and improve the quality of results.", "speakers":[{"affiliation":"Jones McClure Publishing", "bio":"", "email":"", "name":"Will Thompson", "title":"Chief Software Engineer"}], "surveys":[{"comments":"Learned a bit more about the search API but use case didn't resonate for me", "speakerRating":2, "contentRating":2},{"comments":"Great to see a good hands-on presentation with practical tips and tricks balanced with architectural guidance. Love to see more like this!", "speakerRating":5, "contentRating":5},{"comments":"Engaging speaker, interesting tech. ", "speakerRating":5, "contentRating":5},{"comments":"Interesting topic that probably deserved a little more time to present; speaker was rushed (and a little unrehearsed).", "speakerRating":3, "contentRating":4},{"comments":"Speaker was doing great until Jason showed up and sat in the front of the class.\n\"Uh\", and \"So\" became his stables.", "speakerRating":4, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":5},{"comments":"Good examples but speaker's presentation was not very well organized and his delivery was a bit halting. ", "speakerRating":3, "contentRating":4}]}