{"id":"86275434005074200", "giveSurvey":false, "type":"session", "title":"Sneak Peeks", "plenary":false, "selectable":true, "startTime__date":"2012-05-02T10:00:00-04:00", "endTime__date":"2012-05-02T11:00:00-04:00", "track":"Lightning talks", "location":"Meridian D & E", "abstract":"Indexing in MarkLogic 5 and Beyond\nGajanan Chinchwadkar, MarkLogic\n \nIn the continuing quest for ever-faster query processing and analytics, MarkLogic 5 is packed with new indexing options. In this talk you will hear a Lead Engineer from MarkLogic describe the MarkLogic 5 indexing options, and he’ll give you a sneak peek into what he’s working on for future versions of MarkLogic. MarkLogic 5 contains value and range indexing options on fields, to support very fast structured, unstructured, and mixed queries. The talk will include a brief overview of field indexing, querying, and a detailed description of the new options and their uses. You’ll also hear about work that is under way to provide more flexible indexing in a future version of MarkLogic.\n \nUser Defined Functions\nJohn Snelson, Lead Engineer, MarkLogic\n \nEver wanted to write a function in C++ and have it run in the MarkLogic process? What if you could access the range indexes directly from that function and – better yet – write your own in-database MapReduce functions? In this talk John Snelson describes UDFs, which he’s working on for a future release of MarkLogic.\n \nSuper Clusters\nWayne Feick, MarkLogic\nScalability is important for Big Data. In this session we’ll show a Technical Preview of super clusters, which will let you build a cluster of clusters and a database of databases. With a super cluster you’ll have a unified view over databases in several clusters, and you’ll be able to scale out even further than you can with a single cluster.", "speakers":[{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"John Snelson", "title":"Sr. Engineer"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Wayne Feick", "title":"Principal Engineer"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Gajanan Chinchwadkar", "title":"Lead Engineer"}], "surveys":[{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"Very informative!", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":0},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5}]}