{"id":"88215156388469040", "giveSurvey":false, "type":"session", "title":"Big Data Wars ", "plenary":true, "selectable":true, "startTime__date":"2012-05-02T16:30:00-04:00", "endTime__date":"2012-05-02T17:15:00-04:00", "track":"Plenary", "location":"Amphitheater", "abstract":"A recent report by Wikibon includes more than 50 contenders in the Big Data wars. Behemoths like IBM, Oracle & SAP are battling against many start-ups to win a share of this $50B market. Companies are attacking from different points of strength including BI, relational, in-memory, nosql, map-reduce, predictive, and dataviz. So what about MarkLogic? Where is their strong point of attack and how does this position them to win? And where does MarkLogic fit into a big data arsenal along with Hadoop? We believe MarkLogic's innovative technology with \"shared nothing\" search engine plus database plus application server will ultimately prevail. See how MarkLogic is strategically positioned to win the Big Data wars.", "speakers":[{"affiliation":"Avalon Consulting, LLC", "bio":"Tony Jewitt is Vice President of Big Data Solutions at Avalon Consulting, LLC. He has more than 20 years of experience in strategy, marketing and business development within the IT industry. Prior to joining Avalon, Jewitt held executive roles within leading organizations such as Business Objects, InStranet (acquired by Salesforce.com), and Hive Group where he provided thought leadership in the areas of business intelligence, extranets, enterprise content management, and data visualization. Jewitt is currently consulting with multiple Fortune 500 organizations enabling them to capitalize on the convergence of Big Data and Enterprise Search for implementing Big Data Analytics.\nJewitt holds a bachelor of science in electrical and computer engineering from The University of Texas at Austin. ", "email":"", "name":"Tony Jewitt", "title":"VP Big Data Solutions"}], "surveys":[{"comments":"", "speakerRating":5, "contentRating":4},{"comments":"Not as described.  Disappointing\n", "speakerRating":2, "contentRating":1},{"comments":"", "speakerRating":3, "contentRating":4},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":2, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":3},{"comments":"Would love to brief this to my mgmt.", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":0, "contentRating":0},{"comments":"", "speakerRating":5, "contentRating":4}]}