{"id":"97103995628063792", "giveSurvey":false, "type":"session", "title":"Tools\/Techniques, Part 1", "plenary":false, "selectable":true, "startTime__date":"2012-05-01T10:30:00-04:00", "endTime__date":"2012-05-01T11:30:00-04:00", "track":"Lightning talks", "location":"Meridian D & E", "abstract":"XQuery Language-Aware Plugin for IntelliJ\nRon Hitchens, Overstory, Ltd.\n \nThis lightening talk will introduce a new plugin for the popular IntelliJ IDEA Java development tool. The XQuery language plugin brings the full power of the IDE to bear on XQuery code development. Far more that syntax highlighting or auto-complete, the XQuery plugin provides features such as jump to declaration, find usages, variable and function rename, flag unused variables, real refactoring, code generation, and so on. This talk will introduce the open source plugin, describe (and demo) the progress so far and discuss the roadmap for future enhancements. Anyone interested in contributing to the project is encouraged to attend. \n  \nXQuery Debugging with oXygen\nGeorge Bina, Syncro Soft; Stefan Vasile, Syncro Soft\n \noXygen XML Editor brings together support for all XML related technologies and a powerful development environment for MarkLogic. It is an ideal choice for people working with XML, schemas, XQuery and MarkLogic. While XQuery debugging against MarkLogic has been available in oXygen for some time, it has not been easy to debug XQuery scripts that were part of a web application. Now, the oXygen XQuery debugger can intercept XQuery code that runs on the server as part of an application, and you can easily see what happens by inspecting and controlling the execution inside the oXygen XQuery debugger. oXygen also now also supports XQuery validation directly in MarkLogic server.\n \nConfiguration Management\nNorman Walsh, MarkLogic\n \nConfiguration management makes it easy to review the current configuration of a MarkLogic cluster and copy the configuration for specific application servers and databases to another cluster. This talk will review and demonstrate the new Configuration Management features of MarkLogic 5.", "speakers":[{"affiliation":"Syncro Soft", "bio":"Stefan Vasile is CEO and one of the founders of Syncro Soft, the company\nthat develops oXygen XML Editor. Although he has a management role he is\nalso a technical person and he was actively involved in developing the\nXQuery and XSLT debugging support in oXygen as well as the support for\nMarkLogic and other XML Databases.", "email":"stefan@oxygenxml.com", "name":"Stefan Vasile", "title":"CEO"},{"affiliation":"Syncro Soft", "bio":"George Bina is one of the founders of Syncro Soft, the company that develops oXygen XML Editor. He has more than 10 years experience in working with XML and related technologies including XML related projects, oXygen XML Editor and participation in open source projects,\nthe most notable being oNVDL—an open source implementation of the NVDL standard, project that is now merged into Jing.", "email":"george@oxygenxml.com", "name":"George Bina", "title":"Partner"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Norm Walsh", "title":"Lead Engineer"},{"affiliation":"Overstory, Ltd.", "bio":"Ron is well-qualified as a MarkLogic expert — he spent five years at MarkLogic on the Core Server Engineering Team.\n \nRon joined MarkLogic in the early startup days, as employee #20. By the time he left, MarkLogic was well-established as the industry-leading XML platform and had grown to nearly 200 people.\n \nRon is also an accomplished Java architect, author and conference speaker. Java NIO was published by O'Reilly in 2002, Ron was awarded the JavaOne Rockstar Award in 2005 and was inducted by Sun into the Java Champions program in 2008.\n \nWhile at MarkLogic, Ron also wrote Getting Started with XQuery for the Pragmatic Programmers Bookshelf. Ron has spoken nearly every year at the annual MarkLogic User Conference (as well as helping organise the first several).", "email":"", "name":"Ron Hitchens", "title":"Co-Founder and Principal Consultant"}], "surveys":[{"comments":"Problem wih audio but it was fied", "speakerRating":4, "contentRating":4},{"comments":"Keep doing these", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"Very very excited about the new remote debugging in oxygen. I have been waiting for this for years!", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"Three very useful presentations for developers", "speakerRating":4, "contentRating":5},{"comments":"Demos!  Thank you.", "speakerRating":4, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"Very much enjoyed George's XQuery debugging session via Oxygen.", "speakerRating":4, "contentRating":4},{"comments":"company:marklogic", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"debuging is important and any solutions that might make dev life easier helps. would look forward when oxygen will anounce indenting for xquery ", "speakerRating":5, "contentRating":4}]}