{"id":"18200120213441550", "giveSurvey":false, "type":"session", "title":"Application Stories", "plenary":false, "selectable":true, "startTime__date":"2012-05-02T14:00:00-04:00", "endTime__date":"2012-05-02T15:00:00-04:00", "track":"Lightning talks", "location":"Meridian D & E", "abstract":"Map-Reduce Content Processing in MarkLogic\nOlav Schwering, MarkLogic\n \nThis talk is about how we solved a challenge to publish books\/journal submissions in one single transaction that contain multiple parts where each part has to be processed in a separate task. Each part has to go through a few steps to reach the final XML layout that will be finally published. A typical process is collect data (external services\/file system), convert content (PDF to text), transform, enrich with additional meta information, do a consistent check and build the final document that can be published. The solution was to build a flexible, extensible and distributed processing environment that uses all available MarkLogic resources in a cluster.\n \nA Flexible Content Service & API at the New England Journal of Medicine\nRobert Chavez, New England Journal of Medicine\n \nAt the New England Journal of Medicine (NEJM), MarkLogic plays a central role in managing NEJM publication content and disseminating that content to a myriad of consumers.  In order to disseminate this content in an easily digestible and scalable way, and keep up with emerging digital publishing trends and opportunities, we have implemented a MarkLogic-based content service that serves three basic functional requirements: (1) content provisioning to licensees and publishing platforms, (2) live content feeds to web sites, mobile apps, and feed readers, and (3) a NEJM content API for internal and external developers. MarkLogic is at the core of this content service acting as the content\/metadata store and providing content processing and content transformation functions in the form of xquery and xslt libraries.  JBoss and RESTlet provide the RESTful interface that internal and external consumers can use to access content services.", "speakers":[{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Olav Schwering", "title":"Senior Technical Consultant, Germany"},{"affiliation":"New England Journal of Medicine", "bio":"", "email":"", "name":"Robert Chavez", "title":"Architect"}], "surveys":[{"comments":"", "speakerRating":2, "contentRating":2},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"Speakers need to prepare to be speakers. Too difficult to focus.", "speakerRating":2, "contentRating":2},{"comments":"", "speakerRating":3, "contentRating":3}]}