{"id":"22385462606325744", "giveSurvey":false, "type":"session", "title":"Trends in Big Data", "plenary":true, "selectable":true, "startTime__date":"2012-05-02T13:00:00-04:00", "endTime__date":"2012-05-02T14:00:00-04:00", "track":"Plenary", "location":"Amphitheater", "abstract":"In this panel, leading analysts from 451 Research, Gartner, and Forrester will take the stage to discuss trends in Big Data. Moderated by MarkLogic VP of Product Strategy David Gorbet, the panel will discuss the state of Big Data today, the major trends we’ll see through the end of 2012, and what we can expect over the next five years. The analysts will also discuss how Big Data is being used by real companies around the world, the impact Hadoop is having on the space, and what’s beyond Big Data.", "speakers":[{"affiliation":"Forrester Research", "bio":"Noel serves Application Development & Program Delivery professionals. He primarily covers database management systems (DBMSes), IaaS, data replication and integration, data security, data management tools, and related online transaction processing issues. His current primary research focus is on customer usage experiences and broad industry trends of DBMS, IaaS, data security, enterprise data grids, outsourcing, information life-cycle management, open source databases, and other emerging database technologies. \nNoel has more than 20 years of experience in IT and has held various technical and management positions. He came to Forrester through its acquisition of Giga Information Group. Prior to joining Giga, Noel spent several years at Exodus Communications and led a group responsible for planning and implementing mission-critical enterprise applications. Prior to Exodus, he served as a principal consultant, benchmark specialist, and data architect for Amdahl. He has worked on several large, terabyte-sized database applications and deployed high-availability and high-scalability solutions for various enterprises. He has vast experience in implementing and supporting leading DBMSes and data management products. ", "email":"", "name":"Noel Yuhanna", "title":"Principal Analyst"},{"affiliation":"Gartner Research", "bio":"Mark Beyer is a research vice president in Gartner, where he has specialized in information architectures, data integration and business intelligence strategies, data solution architectures and technologies for data warehousing, data marts, and data integration. His area of coverage extends into SOA principles for data management. From a practical perspective, prior to joining Gartner, Mr. Beyer has almost 11 years of direct field experience in data management, integration, business intelligence and application development and was a power user before that. \n \nMr. Beyer has extensive experience in IT project and program delivery utilizing multiple project management and systems design methodologies. Before joining Gartner, Mr. Beyer worked as an implementation consultant delivering enterprise analytics and data warehousing with direct field experience for BearingPoint, Ascential Software, Ardent Software and Prism Solutions since 1997. He is a data integration services architect as well as an experienced data modeler with expertise in deriving physical database design from logical models. Industry solutions delivered include investor-owned utilities, wholesale\/distribution, retail manufacturing, insurance, medical supplies, construction, consumer packaged goods, logistics management and point-of-sale analysis. His experience includes the design and deployment of e-commerce solutions using Java Beans, EJB and JSP, as well as ASP solutions. Mr. Beyer was an energy industry consultant from 1989 through 1997, coordinating the design and implementation of primary data collection systems to support investor-owned utility company research, U.S.\/DOE research, and energy industry consortia. He has direct expertise in multiple project methodologies, project management, business intelligence solution design, business process definition, logical data modeling, physical database design, ETL architectures, XML utilization, real-time data warehousing and operational data stores. ", "email":"", "name":"Mark Beyer", "title":"VP"},{"affiliation":"451 Research", "bio":"As Research Manager for data management and analytics within 451 Research's Information Management practice, Matt has overall responsibility for the coverage of operational and analytic databases, data integration, data quality, and business intelligence. Matt's own primary area of focus is on relational and non-relational databases, data warehousing, data caching, and Hadoop. Matthew is also an expert in open source software and regularly contributes to 451 Research's open source-related research. Prior to joining 451 Research, Matthew was Deputy Editor of monthly magazine Computer Business Review and ComputerWire's daily news service. \n \nMatthew started in IT journalism in 1997 as a staff writer with monthly magazine Unix and NT News, where he became editor in 2000. He has also contributed to a number of other publications. Matthew holds a BA in Multimedia Journalism from Bournemouth University in the UK. ", "email":"", "name":"Matt Aslett", "title":"Research Manager, Data Management & Analytics"},{"affiliation":"MarkLogic", "bio":"", "email":"david.gorbet@marklogic.com", "name":"David Gorbet", "title":"VP, Product Strategy"}], "surveys":[{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"Worst session ever - so Boring!!", "speakerRating":1, "contentRating":1},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":2, "contentRating":2},{"comments":"Really good information provided by Matt and Beyer.", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":3},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"The discussion was not too enlightening. ", "speakerRating":3, "contentRating":2},{"comments":"Very useful information.", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":3, "contentRating":3},{"comments":"Some of thr speakers did not stay on topic", "speakerRating":4, "contentRating":4}]}