{"id":"5732775316994676", "giveSurvey":false, "type":"session", "title":"Bust Silos and Unify Your Data with MarkLogic’s Enterprise Data Layer ", "plenary":false, "selectable":true, "startTime__date":"2012-05-01T13:45:00-04:00", "endTime__date":"2012-05-01T14:45:00-04:00", "track":"Technical", "location":"Hemisphere A", "abstract":"Data is often scattered across heterogeneous environments, organizational silos, and inconsistent formats, compromising data integrity and making it difficult to get a holistic view of the organization, conduct thorough analyses, and share information. Attend this session to learn how MarkLogic can help you take ownership of your data and dramatically reduce costs through its agile, secure, high-performance Enterprise Data Layer solution.", "speakers":[{"affiliation":"MarkLogic", "bio":"Chris Biow is Public Sector CTO and Vice President at MarkLogic Corporation, providing technical leadership for the company’s government division. He has worked with Big Data, search, database, and knowledge management applications for over twenty years, previously at Verity, Autonomy, and the Naval Research Laboratory. His work includes Big Data  projects with the Department of Defense, the National Archives, the U.S. intelligence community, and Bloomberg News. His career also includes 8 years as a Radar Intercept Officer, flying the aircraft-carrier-based F-14 Tomcat. Chris is a graduate of the United States Naval Academy and earned his Master’s degree from the University of Maryland.\n", "email":"chris.biow@marklogic.com", "name":"Chris Biow", "title":"Federal CTO, VP"},{"affiliation":"MarkLogic", "bio":"", "email":"", "name":"Idriss Mekrez", "title":"Principal Technologist"}], "surveys":[{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"Decent intro to the EDL, but not the level of detail or insight I was hoping for.", "speakerRating":3, "contentRating":3},{"comments":"Did not explain enough detail in process steps", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":5, "contentRating":5}]}