{"id":"62718747230246664", "giveSurvey":false, "type":"session", "title":"MarkLogic Big Data Technology Update ", "plenary":true, "selectable":true, "startTime__date":"2012-05-01T08:40:00-04:00", "endTime__date":"2012-05-01T10:00:00-04:00", "track":"Plenary", "location":"Amphitheater", "abstract":"Come hear MarkLogic executives Keith Carlson, COO, and Gary Lang, EVP Products, talk about MarkLogic’s vision for the future and how MarkLogic is innovating to solve tomorrow’s data challenges. Look through our crystal ball and see what’s in store, and learn first-hand through customer interviews and product demonstrations how MarkLogic is helping our customers bring their big ideas to life today, and positioning them for success tomorrow.", "speakers":[{"affiliation":"MarkLogic", "bio":"Keith Carlson is the executive vice president and COO at MarkLogic. Keith has more than 25 years of experience growing services and software companies in Silicon Valley. Keith began his career at Accenture, where he worked his way up from staff consultant to senior Partner. In 1994, he founded Accenture's highly successful partnership with Siebel Systems. Under Keith''s leadership, Accenture's Siebel practice grew to 1,000 professionals and $400M in annual sales in six years. Prior to joining MarkLogic, Keith was president and CEO of Growth Stage Partners, a specialty consulting firm focused on advising high-growth technology companies in the areas of professional services and strategic alliances. \n \nPreviously, Keith was president and CEO of Innotas where he was responsible for all strategic and operational activities at the fast-growing SaaS software company. Prior to this, Keith was vice president of global services at Traiana where he architected a turnaround of the services organization. Traiana was ultimately acquired by ICAP in a very successful and accretive acquisition. Keith was also the vice president of customer value\/alliances at Kintana when it was acquired by Mercury Interactive. Prior to this, he was the chief customer officer at DigitalThink when the company went public on the NASDAQ in a highly successful IPO. Keith holds a bachelor's degree in Industrial Engineering from California Polytechnic State University. ", "email":"", "name":"Keith Carlson", "title":"Executive Vice President and COO"},{"affiliation":"MarkLogic", "bio":"Gary Lang is the senior vice president of engineering for MarkLogic. Lang is a proven leader with more than two decades experience delivering large, complex products and systems, architectural design and direction setting for high-revenue software projects. Lang is responsible for all of MarkLogic product development. Lang comes to MarkLogic from Microsoft, where he was a leader in the development of the next version of Visual Studio. \n \nPrior to Microsoft, Gary was vice president of platforms and global engineering at Autodesk, where he led an organization of 1,200 employees worldwide providing platform and product engineering for Autodesk's core products as well as new software and services for emerging businesses. His organization was responsible for developing code for almost all of Autodesk's desktop and SaaS products, such as AutoCAD, Inventor, and Seek, which generated up to $2.5 billion in revenue. During this period, Lang also served as the vice president of global engineering for the company and managed its offices in China and Singapore. Earlier in his career, Lang was vice president of engineering for Autodesk's infrastructure division. He led the engineering team for all geospatial products, including Map and MapGuide Server. Lang was also a co-creator of the OSGeo Foundation, the first industry-wide open source foundation for geospatial software and services. \n \nLang has a bachelor's degree in computer and information science from the University of California, Santa Cruz. ", "email":"", "name":"Gary Lang", "title":"Senior Vice President, Engineering"}], "surveys":[{"comments":"", "speakerRating":4, "contentRating":3},{"comments":"Too scripted", "speakerRating":4, "contentRating":3},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"Great demos", "speakerRating":5, "contentRating":5},{"comments":"Technology section and concrete examples were appreciated", "speakerRating":3, "contentRating":3},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":5, "contentRating":4},{"comments":"", "speakerRating":4, "contentRating":4},{"comments":"", "speakerRating":5, "contentRating":5},{"comments":"", "speakerRating":4, "contentRating":4}]}